<template>
  <header_comp :show_all="show_all" :show_films="show_films" :show_serials="show_serials" :show_cartoons="show_cartoons"></header_comp>
  <main>
    <card v-if="item_info == null" v-for="(el, i) in cards" :key="el.id" :index="i" :el_c="el" :show_item="show_item"/>
    <Item v-if="item_info != null" :item_info="item_info"></Item>
  </main>
  
  <footer_comp></footer_comp>
</template>

<script>
import Card from './components/card.vue';
import Footer_comp from './components/footer_comp.vue';
import Header_comp from './components/header_comp.vue';
import Item from './components/Item.vue';

  export default{
    components: {Card, Footer_comp, Header_comp, Item},
    data(){
      return{
        data_list: [
        {
        id:0,
        name:"Сверхестественное",
        logo:"/src/card_img/supernatural.jpg",
			  type:"serial",
        link:"https://supernatural-spn.online",
        info:"Сериал Сверхъестественное повествует о различных историях, происходящих с братьями Винчестерами во время их скитаний по США."
      },
		  {
        id:1,
		    name:"Во все тяжкие",
        logo:"/src/card_img/season-2.jpg",
			  type:"serial",
        link:"https://во-все-тяжкие.рф",
        info:"Во все тяжкие - это шедевр от Винса Гиллигана, представляющий собой криминальный коктейль в духе Нео-Запада. Проект, идущий на AMC с 2008 по 2013 годы, погружает нас в жизнь Уолтера Уайта - учителя химии, который стоит на пороге смерти из-за рака. Используя свои навыки и помощь экс-ученика Джесси Пинкмана, Уолтер начинает создание кристаллов метамфетамина. Смотрите онлайн в хорошем качестве трансформацию от мирного педагога к королю наркотрафика."
		  },
		  {
        id:2,
		    name:"Уэйн",
        logo:"/src/card_img/yein.jpg",
			  type:"serial",
        link:"https://hd.lordserial6.life/254-ujejn-2019.html",
        info:"В первого взгляда может показаться, что шестнадцатилетний юноша по имени Уэйн хулиган и нарушитель общественного спокойствия. Однако, это человек трагической судьбы, в столь молодом возрасте уже прошедший через суровые испытания. Все началось еще в детстве, когда мать бросила семью, вдобавок забрав Pontiac Trans Am, на котором поехала к любовнику во Флориду. Затем отец слег в постель и нуждался в дорогостоящих лекарствах, оттягивающих неизбежную гибель. Когда настал момент покинуть грешную Землю, он пожелал, чтобы сын вернул вышеуказанный автомобиль. Другого наследства старик не может оставить. Намереваясь выполнить волю усопшего, Уэйн отправляется в путешествие из родного Бостона. К нему присоединяется бойкая подружка Дэл, матерая воровка и скандалистка. Ее родители умеют лишь напиваться и закатывать истерики, от того дома ничто барышню не держит."
		  },
		  {
        id:3,
		    name:"Пацаны",
        logo:"/src/card_img/the_boys.jpg",
			  type:"serial",
        link:"https://lordserial-o.net/3135-pacany.html",
        info:"Действие сериала разворачивается в мире, где существуют супергерои. Именно они являются настоящими звездами. Их все знают и обожают. Но за идеальным фасадом скрывается гораздо более мрачный мир наркотиков и секса, а большинство героев — в жизни не самые приятные люди. Противостоит им отряд, неофициально известный как «Пацаны»."
		  },
		  {
        id:4,
		    name:"Кунгфу панда 4",
        logo:"/src/card_img/panda.jpg",
			  type:"cartoon",
        link:"https://po.kung-fu-panda-lordfilm.net/4-chast/",
        info:"Продолжение приключений легендарного воина По, его верных друзей и наставника."
		  },
		  {
        id:5,
		    name:"Неуйзвимий",
        logo:"/src/card_img/Invincible.jpg",
			  type:"cartoon",
        link:"https://hd1.26lordserial.xyz/1282-neuiazvimyi-sv-38.html",
        info:"17-летний Марк Грэйсон — сын самого могучего супергероя на Земле, и вскоре ему самому предстоит обрести суперспобности и научиться им управлять."
		  },
		  {
        id:6,
		    name:"Не шутите с Зоханом",
        logo:"/src/card_img/zohan.jpg",
			  type:"film",
        link:"https://tv.lordfilmi.org/921-film-ne-shutite-s-zohanom.html",
        info:"Не шутите с Зоханом (2008) Фильм - это комедия, которая заставит вас не только смеяться до слез, но и задуматься о реальных проблемах нашего мира. Основой сюжета фильма является жизнь израильского агента Зохана Двира, который посвятил свою жизнь борьбе с террористами вместе со спецслужбой Моссад. Но однажды он узнает, что доставленного им врага уже поменяли на двух шпионов, и не выдерживает такого обмана. Решив уйти со службы, Зохан отправляется в США, где надеется найти новую работу. Тем временем, в Палестинском районе Нью-Йорка, наш герой случайно находит работу парикмахера. Но кроме стрижек, Зохан обожает еще одно занятие - он умеет ублажать клиенток. Именно благодаря этому таланту, его бизнес начинает идти в гору. Но все меняется, когда бывший соратник Фантома узнает о местонахождении врага и немедленно извещает Зохана. Теперь наш герой должен решить, продолжать ли вести двойную жизнь или вернуться к своим корням и бороться с терроризмом. Ведь за всеми шутками и приколами скрывается серьезная проблема, которую необходимо решить. Фильм «Не шутите с Зоханом» показывает, что спасать мир можно не только с помощью оружия, но и с помощью юмора и хороших намерений. Пусть наш герой не был супергероем, но он точно победил зло с помощью своего уникального таланта."
		  },
		  {
        id:7,
		    name:"Стекло",
        logo:"/src/card_img/steklo.jpg",
			  type:"film",
        link:"https://star-wars-lordfilm.com/film/steklo",
        info:"Фильм «Стекло» – завершающая часть трилогии М. Найта Шьямалана, где судьбы персонажей «Неуязвимого» и «Сплит» переплетаются в неожиданный сюжет. В центре истории — Элайджа Прайс, известный как Мистер Стекло, доказывающий, что сверхчеловеческие способности реальны. Рядом с ним оказываются Дэвид Данн и Кевин Уэнделл Крамб, также обладающие необычными способностями. Тонкие психологические портреты персонажей, динамичное развитие сюжета и неожиданный финал заставляют зрителя переосмыслить представления о героях и злодеях."
		  },
		  {
        id:8,
		    name:"ВСЕГДА ГОВОРИ ДА",
        logo:"/src/card_img/yes.jpg",
			  type:"film",
        link:"https://tv.lordfilmi.org/1019-film-vsegda-govori-da.html",
        info:"Всегда говори «ДА» (2008) Фильм рассказывает историю о парне по имени Карл Аллен, который всю жизнь мечтал о простой и спокойной жизни. Но из-за своего сложного характера и нелюдимости он испытывал постоянные трудности в общении с людьми. Его бросает девушка, а лучший друг начинает избегать его компанию."
		  }
    ],
        cards: [],
        item_info: null
      }
    },
    methods: {
      show_films(){
        this.item_info = null;
        console.log('Show Films');
        this.cards = [];
        for(var i=0; i<this.data_list.length; i++){
          if(this.data_list[i].type=="film"){
            this.cards.push(this.data_list[i]);
          }
        }
      },
      show_serials(){
        this.item_info = null;
        console.log('Show Serials');
        this.cards = [];
        for(var i=0; i<this.data_list.length; i++){
          if(this.data_list[i].type=="serial"){
            this.cards.push(this.data_list[i]);
          }
        }
      },
      show_cartoons(){
        this.item_info = null;
        console.log('Show Cartoons');
        this.cards = [];
        for(var i=0; i<this.data_list.length; i++){
          if(this.data_list[i].type=="cartoon"){
            this.cards.push(this.data_list[i]);
          }
        }
      },
      show_all(){
        this.cards = this.data_list;
        this.item_info = null;
      },
      show_item(i){
        this.item_info = this.data_list[i];
      }
    },
  } 
</script>

<style scoped>
main{
  display: flex;
  flex-wrap: wrap;
  margin-bottom: 30px;
}

</style>
